Revit 2027 API
Camera.ViewDirection Property
 Direction that the camera is facing
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ViewDirection { get; set; }
Public Property ViewDirection As XYZ
	Get
	Set
public:
property XYZ^ ViewDirection {
	XYZ^ get ();
	void set (XYZ^ value);
}
member ViewDirection : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace